{
  "guideline_id": "NG84",
  "name": "Sore Throat (Acute): Antimicrobial Prescribing",
  "version": "February 2023",
  "citation": "NICE NG84 Clinical Guideline: Sore Throat (Acute): Antimicrobial Prescribing",
  "citation_url": "https://www.nice.org.uk/guidance/ng84",
  "rules": [
    "IF FeverPAIN score is 0 or 1 OR Centor score is 0, 1, or 2 THEN Do not offer an antibiotic.",
    "IF FeverPAIN score is 2 or 3 THEN Consider no antibiotic or a back-up antibiotic prescription.",
    "IF FeverPAIN score is 4 or 5 OR Centor score is 3 or 4 THEN Consider an immediate antibiotic or a back-up antibiotic prescription.",
    "IF no antibiotic is given THEN Advise that an antibiotic is not needed, and medical help should be sought if symptoms worsen rapidly or significantly, or do not start to improve after 1 week, or if the person becomes very unwell.",
    "IF a back-up antibiotic prescription is given THEN Advise that the antibiotic is not needed immediately, use the prescription if no improvement in 3 to 5 days, or symptoms worsen, and seek medical help if symptoms worsen rapidly or significantly or if the person becomes very unwell.",
    "IF an immediate antibiotic prescription is given THEN Advise to seek medical help if symptoms worsen rapidly or significantly or if the person becomes very unwell.",
    "IF person is systemically very unwell OR has symptoms and signs of a more serious illness or condition OR has high risk of complications THEN Offer an immediate antibiotic prescription.",
    "IF severe systemic infection or severe complications occur THEN Refer to hospital.",
    "IF person requires self-care THEN Consider paracetamol for pain or fever or if preferred and suitable, ibuprofen; advise to drink adequate fluids; note that some evidence supports medicated lozenges to reduce pain in adults, but not non-medicated lozenges, mouthwashes, or local anaesthetic mouth spray on its own.",
    "IF diagnosing using FeverPAIN score THEN Assign 1 point for each of the following: Fever; purulence; attend within 3 days or less; severely inflamed tonsils; no cough or coryza.",
    "IF diagnosing using Centor score THEN Assign 1 point for each of the following: Tonsillar exudate; tender anterior cervical lymphadenopathy or lymphadenitis; history of fever (>38°C); no cough."
  ],
  "nodes": [
    {
      "id": "n1",
      "type": "condition",
      "text": "FeverPAIN score is 0 or 1 OR Centor score is 0, 1, or 2"
    },
    {
      "id": "n2",
      "type": "action",
      "text": "Do not offer an antibiotic"
    },
    {
      "id": "n3",
      "type": "condition",
      "text": "FeverPAIN score is 2 or 3"
    },
    {
      "id": "n4",
      "type": "action",
      "text": "Consider no antibiotic or a back-up antibiotic prescription"
    },
    {
      "id": "n5",
      "type": "condition",
      "text": "FeverPAIN score is 4 or 5 OR Centor score is 3 or 4"
    },
    {
      "id": "n6",
      "type": "action",
      "text": "Consider an immediate antibiotic or a back-up antibiotic prescription"
    },
    {
      "id": "n7",
      "type": "action",
      "text": "Advise that an antibiotic is not needed and seek medical help if symptoms worsen or do not start to improve after 1 week or if the person becomes very unwell"
    },
    {
      "id": "n8",
      "type": "action",
      "text": "Advise that the antibiotic is not needed immediately; use prescription if no improvement in 3 to 5 days, or symptoms worsen, and seek medical help if symptoms worsen rapidly or significantly or if the person becomes very unwell"
    },
    {
      "id": "n9",
      "type": "action",
      "text": "Advise to seek medical help if symptoms worsen rapidly or significantly or if the person becomes very unwell"
    },
    {
      "id": "n10",
      "type": "condition",
      "text": "Person is systemically very unwell OR has symptoms and signs of a more serious illness or condition OR has high risk of complications"
    },
    {
      "id": "n11",
      "type": "action",
      "text": "Offer an immediate antibiotic prescription"
    },
    {
      "id": "n12",
      "type": "condition",
      "text": "Severe systemic infection or severe complications"
    },
    {
      "id": "n13",
      "type": "action",
      "text": "Refer to hospital"
    },
    {
      "id": "n14",
      "type": "action",
      "text": "Consider paracetamol for pain or fever or if preferred and suitable, ibuprofen"
    },
    {
      "id": "n15",
      "type": "action",
      "text": "Advise to drink adequate fluids"
    },
    {
      "id": "n16",
      "type": "action",
      "text": "Note evidence supports medicated lozenges to reduce pain in adults, but not for non-medicated lozenges, mouthwashes, or local anaesthetic mouth sprays."
    },
    {
      "id": "n17",
      "type": "condition",
      "text": "Diagnosing using FeverPAIN score"
    },
    {
      "id": "n18",
      "type": "action",
      "text": "Assign 1 point for Fever; purulence; attend within 3 days or less; severely inflamed tonsils; no cough or coryza"
    },
    {
      "id": "n19",
      "type": "condition",
      "text": "Diagnosing using Centor score"
    },
    {
      "id": "n20",
      "type": "action",
      "text": "Assign 1 point for Tonsillar exudate; tender anterior cervical lymphadenopathy or lymphadenitis; history of fever (>38°C); no cough."
    }
  ],
  "edges": [
    {
      "from": "n1",
      "to": "n2",
      "label": "yes"
    },
    {
      "from": "n1",
      "to": "n3",
      "label": "no"
    },
    {
      "from": "n3",
      "to": "n4",
      "label": "yes"
    },
    {
      "from": "n3",
      "to": "n5",
      "label": "no"
    },
    {
      "from": "n5",
      "to": "n6",
      "label": "yes"
    },
    {
      "from": "n4",
      "to": "n7",
      "label": "next"
    },
    {
      "from": "n6",
      "to": "n8",
      "label": "next"
    },
    {
      "from": "n6",
      "to": "n9",
      "label": "next"
    },
    {
      "from": "n10",
      "to": "n11",
      "label": "yes"
    },
    {
      "from": "n12",
      "to": "n13",
      "label": "yes"
    },
    {
      "from": "n14",
      "to": "n15",
      "label": "next"
    },
    {
      "from": "n14",
      "to": "n16",
      "label": "next"
    },
    {
      "from": "n17",
      "to": "n18",
      "label": "yes"
    },
    {
      "from": "n19",
      "to": "n20",
      "label": "yes"
    }
  ]
}